; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-88)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 l15 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity v5 c2)
    (capacity v6 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l2)
    (at p2 l12)
    (at p3 l9)
    (at p4 l3)
    (at p5 l3)
    (at p6 l11)
    (at p7 l13)
    (at p8 l5)
    (at p9 l10)
    (at p10 l4)
    (at p11 l13)
    (at p12 l3)
    (at p13 l8)
    (at p14 l12)
    (at p15 l10)
    (at v1 l13)
    (at v2 l8)
    (at v3 l3)
    (at v4 l2)
    (at v5 l5)
    (at v6 l2)
    (road l6 l15)
    (road l4 l9)
    (road l3 l10)
    (road l5 l1)
    (road l10 l6)
    (road l10 l3)
    (road l10 l9)
    (road l8 l12)
    (road l11 l8)
    (road l2 l8)
    (road l7 l1)
    (road l6 l14)
    (road l14 l6)
    (road l8 l2)
    (road l8 l11)
    (road l9 l4)
    (road l9 l10)
    (road l13 l4)
    (road l10 l8)
    (road l1 l5)
    (road l6 l10)
    (road l12 l8)
    (road l4 l13)
    (road l8 l10)
    (road l10 l1)
    (road l1 l7)
    (road l15 l6)
    (road l1 l10)
    (road l6 l12)
    (road l12 l6)
    (road l2 l10)
    (road l10 l2)
    (road l9 l12)
    (road l12 l9)
    (road l10 l13)
    (road l13 l10)
    (road l1 l8)
    (road l8 l1)
    (road l8 l9)
    (road l9 l8)
    (road l1 l12)
    (road l12 l1)
    (road l1 l9)
    (road l9 l1)
    (road l11 l13)
    (road l13 l11)
    (road l11 l15)
    (road l15 l11)
    (road l5 l11)
    (road l11 l5)
    (road l4 l6)
    (road l6 l4)
    (road l10 l14)
    (road l14 l10)
    (road l4 l10)
    (road l10 l4)
    (road l9 l11)
    (road l11 l9)
    (road l7 l10)
    (road l10 l7)
    (road l1 l13)
    (road l13 l1)
    (road l5 l14)
    (road l14 l5)
    (road l4 l15)
    (road l15 l4)
    (road l5 l7)
    (road l7 l5)
    (road l4 l8)
    (road l8 l4)
    (road l2 l7)
    (road l7 l2)
    (road l5 l10)
    (road l10 l5)
    )
 (:goal (and 
(at p1 l4)
(at p2 l11)
(at p3 l8)
(at p4 l6)
(at p5 l5)
))
)

; plan
1. (pick-up v3 l3 p4 c1 c2)
   deleted: (at p4 l3) (capacity v3 c2)
   added: (in p4 v3) (capacity v3 c1)
   goals met: 0 of 5
2. (pick-up v3 l3 p5 c0 c1)
   deleted: (at p5 l3) (capacity v3 c1)
   added: (in p5 v3) (capacity v3 c0)
   goals met: 0 of 5
3. (drive v3 l3 l10)
   deleted: (at v3 l3)
   added: (at v3 l10)
   goals met: 0 of 5
4. (drive v3 l10 l6)
   deleted: (at v3 l10)
   added: (at v3 l6)
   goals met: 0 of 5
5. (drop v3 l6 p4 c0 c1)
   deleted: (in p4 v3) (capacity v3 c0)
   added: (at p4 l6) (capacity v3 c1)
   goals met: 1 of 5
6. (drive v3 l6 l12)
   deleted: (at v3 l6)
   added: (at v3 l12)
   goals met: 1 of 5
7. (pick-up v3 l12 p2 c0 c1)
   deleted: (at p2 l12) (capacity v3 c1)
   added: (in p2 v3) (capacity v3 c0)
   goals met: 1 of 5
8. (drive v3 l12 l1)
   deleted: (at v3 l12)
   added: (at v3 l1)
   goals met: 1 of 5
9. (drive v3 l1 l5)
   deleted: (at v3 l1)
   added: (at v3 l5)
   goals met: 1 of 5
10. (drop v3 l5 p5 c0 c1)
   deleted: (in p5 v3) (capacity v3 c0)
   added: (at p5 l5) (capacity v3 c1)
   goals met: 2 of 5
11. (pick-up v4 l2 p1 c0 c1)
   deleted: (at p1 l2) (capacity v4 c1)
   added: (in p1 v4) (capacity v4 c0)
   goals met: 2 of 5
12. (drive v3 l5 l11)
   deleted: (at v3 l5)
   added: (at v3 l11)
   goals met: 2 of 5
13. (drop v3 l11 p2 c1 c2)
   deleted: (in p2 v3) (capacity v3 c1)
   added: (at p2 l11) (capacity v3 c2)
   goals met: 3 of 5
14. (drive v4 l2 l10)
   deleted: (at v4 l2)
   added: (at v4 l10)
   goals met: 3 of 5
15. (drive v4 l10 l4)
   deleted: (at v4 l10)
   added: (at v4 l4)
   goals met: 3 of 5
16. (drop v4 l4 p1 c0 c1)
   deleted: (in p1 v4) (capacity v4 c0)
   added: (at p1 l4) (capacity v4 c1)
   goals met: 4 of 5
17. (drive v4 l4 l9)
   deleted: (at v4 l4)
   added: (at v4 l9)
   goals met: 4 of 5
18. (pick-up v4 l9 p3 c0 c1)
   deleted: (at p3 l9) (capacity v4 c1)
   added: (in p3 v4) (capacity v4 c0)
   goals met: 4 of 5
19. (drive v4 l9 l8)
   deleted: (at v4 l9)
   added: (at v4 l8)
   goals met: 4 of 5
20. (drop v4 l8 p3 c0 c1)
   deleted: (in p3 v4) (capacity v4 c0)
   added: (at p3 l8) (capacity v4 c1)
   goals met: 5 of 5
